engleron/ESP32PresenceSensor/ESP32Presence/PresenceRuntime.cpp
#include "PresenceRuntime.h"
#include "PresenceCore.h"
#include "PresenceIntegrations.h"
#include "PresenceWeb.h"
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <esp_heap_caps.h>

namespace {
bool runModeServicesActive = false;
bool runModeWebHandlersConfigured = false;
bool otaCallbacksConfigured = false;
bool serviceModeActive = false;
}  // namespace

void stopRunModeServices();
bool startRunModeServices(bool asServiceMode);
void toggleServiceMode();
unsigned idleStackHeadroom(int core);
void logIdleStackLow();
void checkHeapIntegrity();


/*
 * ================================================================
 * SECTION: LED CONTROL
 * ================================================================
 */

/*
 * blinkBlueHeartbeat - Blink blue LED at 1-second intervals (setup mode).
 */
void blinkBlueHeartbeat() {
  if (millis() - lastHeartbeat > HEARTBEAT_INTERVAL) {
    heartbeatState = !heartbeatState;
    lastHeartbeat  = millis();
    setRGB(0, 0, heartbeatState ? 255 : 0);
  }
}

/*
 * blinkPurpleHeartbeat - Blink purple LED at 1-second intervals (service mode).
 */
void blinkPurpleHeartbeat() {
  if (millis() - lastHeartbeat > HEARTBEAT_INTERVAL) {
    heartbeatState = !heartbeatState;
    lastHeartbeat  = millis();
    setRGB(heartbeatState ? 255 : 0, 0, heartbeatState ? 255 : 0);
  }
}

/*
 * blinkRedBlue - Alternate red/blue at 500ms intervals (error state).
 */
void blinkRedBlue() {
  static unsigned long lastBlink = 0;
  static bool isRed = true;
  if (millis() - lastBlink > 500) {
    isRed = !isRed;
    lastBlink = millis();
    setRGB(isRed ? 255 : 0, 0, isRed ? 0 : 255);
  }
}

/*
 * pulseRedWarning - Pulse red LED during final-minute no-presence warning.
 * Pulse speeds up every 15 seconds as timeout approaches.
 */
void pulseRedWarning(unsigned long remainingMs) {
  unsigned long periodMs = 1600;  // 60s..45s remaining (slow)
  if (remainingMs <= 45000UL) periodMs = 1100;  // 45s..30s
  if (remainingMs <= 30000UL) periodMs = 700;   // 30s..15s
  if (remainingMs <= 15000UL) periodMs = 400;   // 15s..0s (fast)

  unsigned long halfPeriod = periodMs / 2;
  unsigned long phase = millis() % periodMs;
  unsigned long ramp = (phase <= halfPeriod) ? phase : (periodMs - phase);

  // Keep a visible red floor and pulse up to full red.
  int redLevel = 32 + (int)((223UL * ramp) / halfPeriod);
  setRGB(redLevel, 0, 0);
}

/*
 * updateLED - Set LED color based on current sensor state.
 */
void updateLED() {
  static int prevState = -1;
  int state = 0;
  unsigned long remainingMs = 0;

  if (sensorError) {
    blinkRedBlue();
    state = 5;  // reserved for sensor error
  } else if (presenceDetected) {
    setRGB(0, 255, 0);  // Green: presence
    state = 1;
  } else {
    bool warningState = false;
    if (lightOn && noDetectionTimeout > 0) {
      unsigned long timeoutMs = (unsigned long)noDetectionTimeout * 1000UL;
      unsigned long elapsedMs = millis() - lastDetectionTime;
      if (elapsedMs < timeoutMs) {
        remainingMs = timeoutMs - elapsedMs;
        warningState = (remainingMs <= 60000UL);
      }
    }

    if (!lightOn) {
      setRGB(255, 0, 0);  // Red: no presence, hold timer elapsed
      state = 3;
    } else if (warningState) {
      pulseRedWarning(remainingMs);  // Red pulse: hold timer about to elapse
      state = 4;
    } else {
      setRGB(255, 255, 0);  // Yellow: no presence, hold timer counting down
      state = 2;
    }
  }

  if (state != prevState && state != 5) {
    prevState = state;
    // In HomeKit mode the device is a sensor (no light), so the LED reflects
    // the occupancy-hold timer rather than a light. Use matching labels.
    bool hk = (integrationMode == "homekit");
    unsigned long remainingSecs = (remainingMs + 999UL) / 1000UL;
    String msg;
    switch (state) {
      case 1:
        msg = hk ? "GREEN (occupancy detected)" : "GREEN (presence)";
        break;
      case 2:
        msg = hk ? "YELLOW (no presence, occupancy held, clearing in "
                     + String(noDetectionTimeout) + "s)"
                 : "YELLOW (no presence, light on, off in "
                     + String(noDetectionTimeout) + "s)";
        break;
      case 3:
        msg = hk ? "RED (occupancy cleared)" : "RED (no presence, light off)";
        break;
      case 4:
        msg = hk ? "RED PULSE (occupancy clearing in " + String(remainingSecs) + "s)"
                 : "RED PULSE (light off in " + String(remainingSecs) + "s)";
        break;
    }
    if (state >= 1 && state <= 4) {
      serialPrintln("LED: " + msg);
    }
  }
}

/*
 * ================================================================
 * SECTION: SENSOR FUNCTIONS
 * ================================================================
 */

/*
 * ----------------------------------------------------------------
 * LD2410C configuration command protocol
 *
 * Config/ACK frames use a different framing from the data report
 * frames parsed in parseLD2410CSerial():
 *   Header (4): FD FC FB FA
 *   Length (2): payload length, little-endian (command word + value)
 *   Payload   : command word (2, LE) + value bytes
 *   Footer (4): 04 03 02 01
 *
 * Commands used here (per Hi-Link LD2410 serial protocol):
 *   0x00FF enable configuration   (value 0x0001)
 *   0x00FE end configuration
 *   0x0060 set max moving/static gate + no-one duration
 *   0x0064 set per-gate sensitivity (gate 0xFFFF = all gates)
 *
 * Sensitivity values are detection THRESHOLDS (0-100): a gate reports a
 * target only when its energy exceeds the threshold, so a HIGHER value
 * means LESS sensitive / fewer false triggers.
 * ----------------------------------------------------------------
 */

// Send one LD2410 command frame and wait briefly for its ACK.
// Returns true if an ACK with success status (0x0000) was received.
static bool ld2410SendCommand(uint16_t cmd, const uint8_t* value, uint16_t valueLen) {
  uint16_t payloadLen = 2 + valueLen;  // command word + value
  uint8_t header[6] = {0xFD, 0xFC, 0xFB, 0xFA,
                       (uint8_t)(payloadLen & 0xFF), (uint8_t)(payloadLen >> 8)};
  uint8_t cmdWord[2] = {(uint8_t)(cmd & 0xFF), (uint8_t)(cmd >> 8)};
  uint8_t footer[4] = {0x04, 0x03, 0x02, 0x01};

  // Drop any pending RX bytes so we read this command's ACK, not stale data.
  while (Serial2.available()) Serial2.read();

  Serial2.write(header, sizeof(header));
  Serial2.write(cmdWord, sizeof(cmdWord));
  if (valueLen > 0) Serial2.write(value, valueLen);
  Serial2.write(footer, sizeof(footer));
  Serial2.flush();

