engleron/ESP32PresenceSensor/ESP32Presence/PresenceRuntime.cpp
/*
 * parseLD2410CSerial - Non-blocking parser for LD2410C UART data frames.
 *
 * The LD2410C sends basic reporting frames at ~10 Hz:
 *   Header (4): FD FC FB FA
 *   Length (2): 0D 00  (13 bytes of payload)
 *   Payload (13):
 *     [0]    0x02  data-type marker
 *     [1]    0xAA  frame head
 *     [2]    target state: 0=none 1=moving 2=stationary 3=both
 *     [3-4]  moving distance (LE, cm)
 *     [5]    moving energy (0-100)
 *     [6-7]  stationary distance (LE, cm)
 *     [8]    stationary energy (0-100)
 *     [9-10] detection distance (LE, cm)
 *     [11]   0x55  frame tail
 *     [12]   0x00  padding
 *   End (4): 04 03 02 01
 *
 * Uses a 64-byte linear shifting buffer. Validation is structural only
 * (frame markers and declared payload length); the LD2410C basic reporting
 * frame does not include a checksum/CRC byte so none is verified.
 * Populates the uartTarget* globals and sets lastUartUpdateMs.
 */
void parseLD2410CSerial() {
  static uint8_t buf[64];
  static int     bufLen = 0;

  // Drain whatever is in the UART FIFO without blocking.
  while (Serial2.available() > 0 && bufLen < (int)sizeof(buf)) {
    buf[bufLen++] = (uint8_t)Serial2.read();
  }

  // Process all complete frames that fit in the buffer.
  while (bufLen >= 23) {
    // Locate frame header FD FC FB FA.
    int startIdx = -1;
    for (int i = 0; i <= bufLen - 4; i++) {
      if (buf[i] == 0xFD && buf[i+1] == 0xFC &&
          buf[i+2] == 0xFB && buf[i+3] == 0xFA) {
        startIdx = i;
        break;
      }
    }
    if (startIdx < 0) {
      // No header yet — keep last 3 bytes in case it's a partial header.
      int keep = (bufLen >= 3) ? 3 : bufLen;
      memmove(buf, buf + (bufLen - keep), keep);
      bufLen = keep;
      return;
    }

    // Discard bytes before the header.
    if (startIdx > 0) {
      bufLen -= startIdx;
      memmove(buf, buf + startIdx, bufLen);
    }

    // Need a full 23-byte frame.
    if (bufLen < 23) return;

    // Validate data length, markers, and frame end.
    uint16_t dataLen = (uint16_t)buf[4] | ((uint16_t)buf[5] << 8);
    bool valid = (dataLen == 13 &&
                  buf[6]  == 0x02 && buf[7]  == 0xAA &&
                  buf[17] == 0x55 &&
                  buf[19] == 0x04 && buf[20] == 0x03 &&
                  buf[21] == 0x02 && buf[22] == 0x01);
    if (!valid) {
      // Not a basic reporting frame; skip one byte and retry.
      bufLen--;
      memmove(buf, buf + 1, bufLen);
      continue;
    }

    // Parse payload fields.
    uartTargetState        = buf[8];
    uartMovingDistance     = (int)((uint16_t)buf[9]  | ((uint16_t)buf[10] << 8));
    uartMovingEnergy       = (int)buf[11];
    uartStationaryDistance = (int)((uint16_t)buf[12] | ((uint16_t)buf[13] << 8));
    uartStationaryEnergy   = (int)buf[14];
    uartDetectionDistance  = (int)((uint16_t)buf[15] | ((uint16_t)buf[16] << 8));
    lastUartUpdateMs       = millis();

    // Consume the processed frame.
    bufLen -= 23;
    if (bufLen > 0) memmove(buf, buf + 23, bufLen);
  }
}

/*
 * ================================================================

 * SECTION: FACTORY RESET
 * ================================================================
 */

/*
 * checkResetButton - Check if BOOT button is held at startup.
 * @return true if button is pressed at boot time
 */
bool checkResetButton() {
  if (digitalRead(PIN_RESET) == LOW) {
    delay(30);  // debounce BOOT button at startup
    if (digitalRead(PIN_RESET) != LOW) return false;
    serialPrintln(F("BOOT button held at startup - entering setup mode"));
    return true;
  }
  return false;
}

/*
 * checkResetButtonHeld - Monitor BOOT button for 5-second factory reset.
 * Provides staged LED visual feedback during hold.
 * @return true only if factory reset was performed (device restarts)
 */
bool checkResetButtonHeld() {
  static unsigned long pressStartTime = 0;
  static bool wasPressed = false;

  bool isPressed = (digitalRead(PIN_RESET) == LOW);

  if (isPressed && !wasPressed) {
    pressStartTime = millis();
    wasPressed = true;
    serialPrintln(F("BOOT button pressed - hold 5 seconds for factory reset"));
  } else if (!isPressed && wasPressed) {
    unsigned long held = millis() - pressStartTime;
    wasPressed = false;
    setRGB(0, 0, 0);
    if (held >= 80 && held < RESET_HOLD_TIME) {
      if (!configMode) {
        serialPrintln(F("BOOT short press - toggling service mode"));
        toggleServiceMode();
      }
      return false;
    }
    serialPrintln(F("BOOT button released"));
  } else if (isPressed && wasPressed) {
    unsigned long held = millis() - pressStartTime;

    // Stage 1: 0-2 seconds - solid red
    if (held < 2000) {
      setRGB(255, 0, 0);
    }
    // Stage 2: 2-4 seconds - slow red/blue blink (500ms)
    else if (held < 4000) {
      static unsigned long lastBlink = 0;
      static bool blinkState = false;
      if (millis() - lastBlink > 500) {
        blinkState = !blinkState;
        lastBlink = millis();
        setRGB(blinkState ? 255 : 0, 0, blinkState ? 0 : 255);
      }
    }
    // Stage 3: 4-5 seconds - rapid red/blue blink (200ms)
    else if (held < 5000) {
      static unsigned long lastFast = 0;
      static bool fastState = false;
      if (millis() - lastFast > 200) {
        fastState = !fastState;
        lastFast = millis();
        setRGB(fastState ? 255 : 0, 0, fastState ? 0 : 255);
      }
    }
    // 5 seconds reached - perform reset
    else {
      Serial.println(F("\n*** FACTORY RESET TRIGGERED ***"));
      Serial.println(F("Reset in 5... 4... 3... 2... 1... RESETTING!"));

      // Purple confirmation flashes (3x)
      for (int i = 0; i < 3; i++) {
        setRGB(255, 0, 255);
        delay(150);
        setRGB(0, 0, 0);
        delay(150);
      }

      clearConfiguration();
      invalidateSession();

      delay(1000);
      ESP.restart();
      return true;
    }
  }

  return false;
}


/*
 * ================================================================
 * SECTION: WIFI FUNCTIONS
 * ================================================================
 */

void stopRunModeServices() {
  if (!runModeServicesActive) {
    serviceModeActive = false;
    return;
  }

  server.stop();
  MDNS.end();
  runModeServicesActive = false;
  serviceModeActive = false;
  serialPrintln(F("Run-mode web services stopped"));
}

bool startRunModeServices(bool asServiceMode) {
  if (runModeServicesActive) {
    serviceModeActive = asServiceMode;
    if (asServiceMode) {
      heartbeatState = true;
      lastHeartbeat = millis();
      setRGB(255, 0, 255);
    }
    return true;
  }
  if (WiFi.status() != WL_CONNECTED) {
    serialPrintln(F("Cannot start run-mode web services: WiFi not connected"));
    return false;
  }

  if (!runModeWebHandlersConfigured) {
    // esp32 Arduino core 3.x changed collectHeaders to require an array + count
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    const char* collectHeaderKeys[] = {"Cookie"};
    server.collectHeaders(collectHeaderKeys, 1);
#else
    server.collectHeaders("Cookie");
#endif
    setupWebServerRunMode();
    runModeWebHandlersConfigured = true;
  }

#ifdef ENABLE_HOMEKIT
  // HomeSpan owns the mDNS stack in HomeKit mode; calling MDNS.begin() here
  // would reset the hostname and wipe the _hap._tcp service record, making the
  // device invisible in Apple Home. HomeSpan registers presence.local itself.
  if (integrationMode != "homekit")
#endif
  {
    if (MDNS.begin("presence")) {
      serialPrintln(F("mDNS started: http://presence.local"));
    }
  }

  if (!otaCallbacksConfigured) {
    ArduinoOTA.setHostname("esp32-presence");
    ArduinoOTA.onStart([]() { serialPrintln(F("OTA update started...")); });
    ArduinoOTA.onEnd([]()   { serialPrintln(F("OTA update complete!")); });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
      esp_task_wdt_reset();  // feed WDT during blocking OTA receive loop
    });
    ArduinoOTA.onError([](ota_error_t error) {
      serialPrintln("OTA error: " + String(error));
    });
    otaCallbacksConfigured = true;
  }
  ArduinoOTA.begin();
  server.begin();

  runModeServicesActive = true;
  serviceModeActive = asServiceMode;

  if (asServiceMode) {
    heartbeatState = true;
    lastHeartbeat = millis();
    setRGB(255, 0, 255);
    serialPrintln("Service mode enabled (LAN web): http://" + WiFi.localIP().toString());
  } else {
    serialPrintln(F("Run-mode web services enabled"));
  }
  return true;
}

void toggleServiceMode() {
  if (serviceModeActive) {
    stopRunModeServices();
    serialPrintln(F("Service mode disabled - returning to run mode"));
    return;
  }
  if (startRunModeServices(true)) {
    serialPrintln(F("Service mode active - BOOT short press again to exit"));
  }
}

