engleron/ESP32PresenceSensor/ESP32Presence/PresenceRuntime.cpp
/*
 * enterConfigMode - Start AP and captive portal for initial setup.
 */
void enterConfigMode() {
  serialPrintln(F("\n*** ENTERING SETUP MODE ***"));

  stopRunModeServices();
  configMode = true;

  // Force immediate visual setup indication (steady blue, then heartbeat).
  heartbeatState = true;
  lastHeartbeat = millis();
  setRGB(0, 0, 255);

  WiFi.mode(WIFI_AP_STA);  // AP+STA so we can scan networks
  generateDeviceSSID();

  WiFi.softAP(deviceSSID.c_str());
  startWiFiScanAsync();
  serialPrintln(F("Setup mode WiFi scan started"));

  IPAddress apIP = WiFi.softAPIP();

  Serial.println(F("\n================================================"));
  Serial.println(F("*** SETUP MODE ***"));
  Serial.print(F("Connect to WiFi: "));
  Serial.println(deviceSSID);
  Serial.print(F("AP IP Address:   "));
  Serial.println(apIP);
  Serial.println(F("================================================\n"));

  dnsServer.start(DNS_PORT, "*", apIP);

  setupWebServerSetupMode();
  server.begin();

  serialPrintln(F("Setup web server started"));
}

/*
 * connectToWiFi - Connect to configured WiFi network.
 */
void connectToWiFi() {
  serialPrint(F("Connecting to WiFi: "));
  serialPrintln(wifiSSID);

  WiFi.mode(WIFI_STA);
  // Disable modem-sleep power save. The default WIFI_PS_MIN_MODEM makes socket
  // calls sluggish and provokes extra disconnects/roaming, which can stall
  // homeSpan.poll() in the loop past the 8s task watchdog (TG0WDT_SYS_RST).
  // Keeping the radio awake trades a little power for a stable always-on HAP link.
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.begin(wifiSSID.c_str(), wifiPassword.c_str());

  const unsigned long connectTimeoutMs = 30000;
  const unsigned long dotIntervalMs    = 1000;
  unsigned long connectStart           = millis();
  unsigned long lastDotAt              = connectStart;

  while (WiFi.status() != WL_CONNECTED && (millis() - connectStart) < connectTimeoutMs) {
    delay(100);
    // setup() can block here for up to 30s; feed TWDT while waiting for association
    esp_task_wdt_reset();

    if (Serial && debugLevel > 0 && (millis() - lastDotAt) >= dotIntervalMs) {
      Serial.print(".");
      lastDotAt = millis();
    }
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println();
    serialPrintln(F("WiFi connected!"));
    serialPrint(F("IP Address: "));
    serialPrintln(WiFi.localIP().toString());

#ifdef ENABLE_HOMEKIT
    // Must initialise HomeSpan before startRunModeServices so HomeSpan owns the
    // mDNS stack. startRunModeServices skips MDNS.begin() in HomeKit mode.
    initHomeKit();
#endif

#if ENABLE_RUNMODE_WEB_OTA_DEFAULT
    startRunModeServices(false);
#else
    serialPrintln(F("Run mode active (web disabled by default)"));
    serialPrintln(F("Press BOOT briefly to toggle LAN web service mode"));
#endif

  } else {
    Serial.println();
    serialPrintln(F("WiFi connection failed! Entering setup mode..."));
    enterConfigMode();
  }
}

/*
 * ================================================================
 * SECTION: SETUP AND LOOP
 * ================================================================
 */

void presenceInit() {
  deviceStartTime = millis();

  Serial.begin(BAUD_RATE_DEBUG);
  delay(100);

  Serial.println(F("\n\n================================================"));
  Serial.println(F("ESP32 LD2410C Presence Detection System"));
  Serial.print(F("Firmware Version: "));
  Serial.println(FIRMWARE_VERSION);
  Serial.print(F("Board: "));
  Serial.println(BOARD_TYPE);
  Serial.println(F("Integrations: EISY/ISY, Insteon Hub 2, Home Assistant, HomeKit"));
  Serial.println(F("================================================\n"));

  // Initialize NeoPixel LED
  strip.begin();
  strip.show();
  strip.setBrightness(50);
  setRGB(0, 0, 0);
  Serial.print(F("RGB LED on GPIO"));
  Serial.println(RGB_LED_PIN);

  // Reset button
  pinMode(PIN_RESET, INPUT_PULLUP);

  // Load configuration (may override default pins)
  loadConfiguration();

  // Apply saved LED brightness
  strip.setBrightness(ledBrightness);

  // Initialize UART for sensor
  Serial2.begin(BAUD_RATE_SENSOR, SERIAL_8N1, pinSensorTx, pinSensorRx);
  Serial.print(F("Sensor UART: RX=GPIO"));
  Serial.print(pinSensorTx);
  Serial.print(F(", TX=GPIO"));
  Serial.println(pinSensorRx);

  // Initialize sensor OUT pin
  pinMode(pinSensorOut, INPUT);

  // Push saved sensitivity/range tuning to the radar (no-op if tuning disabled).
  // Give the LD2410C ~1 s after power-up before sending config commands; it can
  // ignore commands while still booting, which would silently drop the tuning.
  if (ld2410TuningEnabled) {
    delay(1000);
    applyLd2410Config();
  }

  // Integration worker handles potentially blocking network actions off the main loop
  initIntegrationWorker();

  // Start watchdog timer
  // esp32 Arduino core 3.x changed esp_task_wdt_init to take a config struct
  esp_err_t wdtInitResult = ESP_OK;
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t wdtConfig = {
    .timeout_ms   = WDT_TIMEOUT_SECONDS * 1000,
    .idle_core_mask = 0,
    .trigger_panic  = true
  };
  // On Arduino-ESP32 3.x, TWDT may already be initialized by the core.
  // Reconfigure first to avoid "already initialized" boot errors.
  wdtInitResult = esp_task_wdt_reconfigure(&wdtConfig);
  if (wdtInitResult == ESP_ERR_INVALID_STATE) {
    wdtInitResult = esp_task_wdt_init(&wdtConfig);
  }
#else
  wdtInitResult = esp_task_wdt_init(WDT_TIMEOUT_SECONDS, true);
#endif
  if (wdtInitResult != ESP_OK) {
    serialPrintln("Watchdog init warning, err=" + String((int)wdtInitResult));
  }

  esp_err_t wdtAddResult = esp_task_wdt_add(NULL);
  if (wdtAddResult == ESP_ERR_INVALID_ARG) {
    serialPrintln(F("Watchdog task already registered"));
  } else if (wdtAddResult != ESP_OK) {
    serialPrintln("Watchdog task add warning, err=" + String((int)wdtAddResult));
  }
  serialPrintln(F("Watchdog timer started (8s timeout)"));

  // Decide mode: setup or connect
  if (wifiSSID == "" || checkResetButton()) {
    enterConfigMode();
  } else {
    connectToWiFi();
  }

  Serial.println(F("\n================================================"));
  if (configMode) {
    Serial.println(F("Initialization complete: SETUP MODE ACTIVE"));
    Serial.println(F("Open captive portal or browse http://192.168.4.1"));
  } else {
    Serial.println(F("Initialization complete: RUN MODE ACTIVE"));
  }
  Serial.println(F("================================================\n"));
}

