engleron/ESP32PresenceSensor/ESP32Presence/PresenceRuntime.cpp
/*
 * logHeapStats - Periodically report free-heap diagnostics.
 *
 * Prints current free heap, the largest allocatable block (a fragmentation
 * indicator), and the minimum free heap ever seen since boot. A steadily
 * falling minimum points to a leak; a free heap that stays high while the
 * largest block shrinks points to fragmentation. Either can precede the
 * heap-corruption / out-of-memory crashes seen under HomeKit load.
 */
void logHeapStats() {
#if HEAP_LOG_INTERVAL_MS > 0
  static unsigned long lastHeapLog = 0;
  unsigned long now = millis();
  if (now - lastHeapLog < HEAP_LOG_INTERVAL_MS) return;
  lastHeapLog = now;
  serialPrintln("Heap: free=" + String(ESP.getFreeHeap()) +
                " largestBlock=" + String(ESP.getMaxAllocHeap()) +
                " minFree=" + String(ESP.getMinFreeHeap()) +
                " idleStackMin[c0/c1]=" + String(idleStackHeadroom(0)) +
                "/" + String(idleStackHeadroom(1)));
#endif
}

/*
 * idleStackHeadroom - Minimum free bytes ever seen on the given core's idle
 * task stack since boot (uxTaskGetStackHighWaterMark is a cumulative low-water
 * mark, so coarse sampling never misses the deepest excursion). Returns 0 if
 * the idle handle isn't available.
 */
unsigned idleStackHeadroom(int core) {
  TaskHandle_t idle = xTaskGetIdleTaskHandleForCore(core);
  if (idle == nullptr) return 0;
  return (unsigned)uxTaskGetStackHighWaterMark(idle);
}

/*
 * logIdleStackLow - Print a timestamped line the instant either idle task
 * reaches a new low-water mark. Time-localizing the drop lets us correlate it
 * with the surrounding serial events (occupancy clear, WiFi reconnect, Home
 * Hub controller reconnect) and so identify what runs stack-hungry code in
 * idle context. The crashes are idle-task stack overflows; the default idle
 * stack is ~1.5 KB and can't be enlarged from an Arduino sketch, so this is a
 * pure diagnostic to find the offending code path.
 */
void logIdleStackLow() {
  static unsigned lowest[2] = {0xFFFFFFFFu, 0xFFFFFFFFu};
  for (int core = 0; core < 2; core++) {
    unsigned headroom = idleStackHeadroom(core);
    if (headroom == 0) continue;  // handle not ready
    if (headroom < lowest[core]) {
      lowest[core] = headroom;
      serialPrintln("IDLE" + String(core) + " stack new low: " +
                    String(headroom) + " bytes free");
    }
  }
}

/*
 * checkHeapIntegrity - Periodically scan all heap regions for corruption.
 *
 * The crashes are not stack exhaustion (idle high-water is flat) but a stray
 * write that trips the idle stack-guard watchpoint, which then double-faults
 * and erases its own backtrace. FreeRTOS task stacks are themselves heap
 * allocations, so a write past a task stack corrupts an adjacent heap block's
 * canary. heap_caps_check_integrity_all(true) validates every block's head/tail
 * canary (default builds use light heap poisoning) and prints the offending
 * block's address/details the moment corruption appears - catching it closer to
 * the source, and *before* the fatal access, instead of after a wild crash.
 */
void checkHeapIntegrity() {
#if HEAP_INTEGRITY_CHECK_MS > 0
  static unsigned long lastCheck = 0;
  static bool reported = false;
  unsigned long now = millis();
  if (now - lastCheck < HEAP_INTEGRITY_CHECK_MS) return;
  lastCheck = now;

  // print_errors=true dumps the corrupted block(s) to serial via the heap code.
  bool ok = heap_caps_check_integrity_all(true);
  if (!ok && !reported) {
    reported = true;  // the dump above is the prize; don't spam every interval
    serialPrintln(F("*** HEAP CORRUPTION DETECTED (see block dump above) ***"));
    serialPrintln("At t=" + String(now / 1000.0, 3) + "s  free=" +
                  String(ESP.getFreeHeap()) + " minFree=" +
                  String(ESP.getMinFreeHeap()));
  }
#endif
}

void presenceTick() {
  // Reset watchdog
  esp_task_wdt_reset();

  logHeapStats();
  logIdleStackLow();
  checkHeapIntegrity();

  if (configMode) {
    dnsServer.processNextRequest();
    server.handleClient();
    blinkBlueHeartbeat();
    // Check for reset button even in config mode
    checkResetButtonHeld();
    return;
  }

  // Normal operation
  if (runModeServicesActive) {
    ArduinoOTA.handle();
    server.handleClient();
  }
  checkResetButtonHeld();

  readSensorData();
  parseLD2410CSerial();
  if (serviceModeActive) {
    blinkPurpleHeartbeat();
  } else {
    updateLED();
  }

  controlLight();

#ifdef ENABLE_HOMEKIT
  homeKitLoop();
#endif

  delay(MAIN_LOOP_DELAY_MS);
}

// Enlarge the Arduino loop task stack (default 8 KB). homeSpan.poll() runs on
// this task and performs HAP TLS handshakes on every controller (re)connect —
// stack-hungry, and the device roams across multiple WiFi APs, so handshakes
// happen often. A too-small loop stack can overflow into neighbouring memory
// during a handshake and corrupt the heap, surfacing later as an idle-task
// stack-canary panic. 16 KB gives mbedTLS comfortable headroom.
//
// Defined here (a .cpp), not in the .ino, to avoid Arduino's prototype
// injection; it overrides the core's weak getArduinoLoopTaskStackSize().
size_t getArduinoLoopTaskStackSize(void) {
  return 16 * 1024;
}

void setup() {
  presenceInit();
}

void loop() {
  presenceTick();
}
